zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE14F16/MKE14F16.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>FLEXIO</name>
      <description>Flexible I/O - universal I/O module for communication (UART, SPI, I2C, I2S) and PWM purposes.</description>
      <groupName>FLEXIO</groupName>
      <prependToName>FLEXIO_</prependToName>
      <baseAddress>0x4005A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x510</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXIO</name>
        <value>69</value>
      </interrupt>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FEATURE_0</name>
                  <description>Standard features implemented.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEATURE_1</name>
                  <description>Supports state, logic and parallel modes.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4080404</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTER</name>
              <description>Shifter Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER</name>
              <description>Timer Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN</name>
              <description>Pin Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIGGER</name>
              <description>Trigger Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>FlexIO Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXEN</name>
              <description>FlexIO Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXEN_0</name>
                  <description>FlexIO module is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXEN_1</name>
                  <description>FlexIO module is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWRST_0</name>
                  <description>Software reset is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWRST_1</name>
                  <description>Software reset is enabled, all FlexIO registers except the Control Register are reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FASTACC</name>
              <description>Fast Access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FASTACC_0</name>
                  <description>Configures for normal register accesses to FlexIO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FASTACC_1</name>
                  <description>Configures for fast register accesses to FlexIO</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGE</name>
              <description>Debug Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBGE_0</name>
                  <description>FlexIO is disabled in debug modes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBGE_1</name>
                  <description>FlexIO is enabled in debug modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZEN</name>
              <description>Doze Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOZEN_0</name>
                  <description>FlexIO enabled in Doze modes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOZEN_1</name>
                  <description>FlexIO disabled in Doze modes.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN</name>
          <description>Pin State Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDI</name>
              <description>Pin Data Input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHIFTSTAT</name>
          <description>Shifter Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSF</name>
              <description>Shifter Status Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSF_0</name>
                  <description>Status flag is clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSF_1</name>
                  <description>Status flag is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHIFTERR</name>
          <description>Shifter Error Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEF</name>
              <description>Shifter Error Flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEF_0</name>
                  <description>Shifter Error Flag is clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEF_1</name>
                  <description>Shifter Error Flag is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSTAT</name>
          <description>Timer Status Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSF</name>
              <description>Timer Status Flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSF_0</name>
                  <description>Timer Status Flag is clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSF_1</name>
                  <description>Timer Status Flag is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHIFTSIEN</name>
          <description>Shifter Status Interrupt Enable</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSIE</name>
              <description>Shifter Status Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSIE_0</name>
                  <description>Shifter Status Flag interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSIE_1</name>
                  <description>Shifter Status Flag interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHIFTEIEN</name>
          <description>Shifter Error Interrupt Enable</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEIE</name>
              <description>Shifter Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEIE_0</name>
                  <description>Shifter Error Flag interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEIE_1</name>
                  <description>Shifter Error Flag interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMIEN</name>
          <description>Timer Interrupt Enable Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEIE</name>
              <description>Timer Status Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEIE_0</name>
                  <description>Timer Status Flag interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEIE_1</name>
                  <description>Timer Status Flag interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHIFTSDEN</name>
          <description>Shifter Status DMA Enable</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSDE</name>
              <description>Shifter Status DMA Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSDE_0</name>
                  <description>Shifter Status Flag DMA request is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSDE_1</name>
                  <description>Shifter Status Flag DMA request is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>SHIFTCTL%s</name>
          <description>Shifter Control N Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMOD</name>
              <description>Shifter Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMOD_0</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMOD_1</name>
                  <description>Receive mode. Captures the current Shifter content into the SHIFTBUF on expiration of the Timer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMOD_2</name>
                  <description>Transmit mode. Load SHIFTBUF contents into the Shifter on expiration of the Timer.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMOD_4</name>
                  <description>Match Store mode. Shifter data is compared to SHIFTBUF content on expiration of the Timer.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMOD_5</name>
                  <description>Match Continuous mode. Shifter data is continuously compared to SHIFTBUF contents.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOL</name>
              <description>Shifter Pin Polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PINPOL_0</name>
                  <description>Pin is active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINPOL_1</name>
                  <description>Pin is active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINSEL</name>
              <description>Shifter Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PINCFG</name>
              <description>Shifter Pin Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PINCFG_0</name>
                  <description>Shifter pin output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINCFG_1</name>
                  <description>Shifter pin open drain or bidirectional output enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINCFG_2</name>
                  <description>Shifter pin bidirectional output data</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINCFG_3</name>
                  <description>Shifter pin output</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMPOL</name>
              <description>Timer Polarity</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMPOL_0</name>
                  <description>Shift on posedge of Shift clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMPOL_1</name>
                  <description>Shift on negedge of Shift clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMSEL</name>
              <description>Timer Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
