zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE14F16/MKE14F16.xml
        <register>
          <name>HCCR</name>
          <description>HSRUN Clock Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVSLOW</name>
              <description>Slow Clock Divide Ratio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide-by-2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV3</name>
                  <description>Divide-by-3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide-by-4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV5</name>
                  <description>Divide-by-5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <description>Divide-by-6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV7</name>
                  <description>Divide-by-7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide-by-8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVBUS</name>
              <description>Bus Clock Divide Ratio</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide-by-1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide-by-2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV3</name>
                  <description>Divide-by-3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide-by-4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV5</name>
                  <description>Divide-by-5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <description>Divide-by-6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV7</name>
                  <description>Divide-by-7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide-by-8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV9</name>
                  <description>Divide-by-9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV10</name>
                  <description>Divide-by-10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV11</name>
                  <description>Divide-by-11</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <description>Divide-by-12</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV13</name>
                  <description>Divide-by-13</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV14</name>
                  <description>Divide-by-14</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV15</name>
                  <description>Divide-by-15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide-by-16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVCORE</name>
              <description>Core Clock Divide Ratio</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide-by-1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide-by-2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV3</name>
                  <description>Divide-by-3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide-by-4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV5</name>
                  <description>Divide-by-5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <description>Divide-by-6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV7</name>
                  <description>Divide-by-7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide-by-8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV9</name>
                  <description>Divide-by-9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV10</name>
                  <description>Divide-by-10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV11</name>
                  <description>Divide-by-11</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <description>Divide-by-12</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV13</name>
                  <description>Divide-by-13</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV14</name>
                  <description>Divide-by-14</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV15</name>
                  <description>Divide-by-15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide-by-16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>System Clock Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOCS</name>
                  <description>System OSC (SOSC_CLK)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRC</name>
                  <description>Slow IRC (SIRC_CLK)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRC</name>
                  <description>Fast IRC (FIRC_CLK)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>System PLL (SPLL_CLK)</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKOUTCNFG</name>
          <description>SCG CLKOUT Configuration Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKOUTSEL</name>
              <description>SCG Clkout Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLOW</name>
                  <description>SCG SLOW Clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOCS</name>
                  <description>System OSC (SOSC_CLK)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRC</name>
                  <description>Slow IRC (SIRC_CLK)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRC</name>
                  <description>Fast IRC (FIRC_CLK)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>System PLL (SPLL_CLK)</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SOSCCSR</name>
          <description>System OSC Control Status Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOSCEN</name>
              <description>System OSC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>System OSC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>System OSC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCSTEN</name>
              <description>System OSC Stop Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>System OSC is disabled in Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>System OSC is enabled in Stop modes if SOSCEN=1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCLPEN</name>
              <description>System OSC Low Power Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>System OSC is disabled in VLP modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>System OSC is enabled in VLP modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCERCLKEN</name>
              <description>System OSC 3V ERCLK Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>System OSC 3V ERCLK output clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>System OSC 3V ERCLK output clock is enabled when SYSOSC is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCCM</name>
              <description>System OSC Clock Monitor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>System OSC Clock Monitor is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>System OSC Clock Monitor is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCCMRE</name>
              <description>System OSC Clock Monitor Reset Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRQ</name>
                  <description>Clock Monitor generates interrupt when error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Clock Monitor generates reset when error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITEABLE</name>
                  <description>This Control Status Register can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROTECTED</name>
                  <description>This Control Status Register cannot be written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCVLD</name>
              <description>System OSC Valid</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>System OSC is not enabled or clock is not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>System OSC is enabled and output clock is valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCSEL</name>
              <description>System OSC Selected</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SYSTEM</name>
                  <description>System OSC is not the system clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSTEM</name>
                  <description>System OSC is the system clock source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCERR</name>
              <description>System OSC Clock Error</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ERROR</name>
                  <description>System OSC Clock Monitor is disabled or has not detected an error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>System OSC Clock Monitor is enabled and detected an error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
