zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE14F16/MKE14F16.xml
        <register>
          <name>C1</name>
          <description>CMP Control Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOSEL</name>
              <description>DAC Output Voltage Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEL</name>
              <description>Minus Input MUX Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSEL_0</name>
                  <description>IN0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_1</name>
                  <description>IN1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_2</name>
                  <description>IN2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_3</name>
                  <description>IN3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_4</name>
                  <description>IN4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_5</name>
                  <description>IN5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_6</name>
                  <description>IN6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_7</name>
                  <description>IN7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSEL</name>
              <description>Plus Input MUX Control</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PSEL_0</name>
                  <description>IN0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_1</name>
                  <description>IN1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_2</name>
                  <description>IN2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_3</name>
                  <description>IN3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_4</name>
                  <description>IN4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_5</name>
                  <description>IN5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_6</name>
                  <description>IN6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_7</name>
                  <description>IN7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VRSEL</name>
              <description>Supply Voltage Reference Source Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VRSEL_0</name>
                  <description>Vin1 is selected as resistor ladder network supply reference Vin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VRSEL_1</name>
                  <description>Vin2 is selected as resistor ladder network supply reference Vin.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACEN</name>
              <description>DAC Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DACEN_0</name>
                  <description>DAC is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACEN_1</name>
                  <description>DAC is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHN0</name>
              <description>Channel 0 input enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN1</name>
              <description>Channel 1 input enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN2</name>
              <description>Channel 2 input enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN3</name>
              <description>Channel 3 input enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN4</name>
              <description>Channel 4 input enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN5</name>
              <description>Channel 5 input enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN6</name>
              <description>Channel 6 input enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN7</name>
              <description>Channel 7 input enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INNSEL</name>
              <description>Selection of the input to the negative port of the comparator</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INNSEL_0</name>
                  <description>IN0, from the 8-bit DAC output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INNSEL_1</name>
                  <description>IN1, from the analog 8-1 mux</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Selection of the input to the positive port of the comparator</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPSEL_0</name>
                  <description>IN0, from the 8-bit DAC output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPSEL_1</name>
                  <description>IN1, from the analog 8-1 mux</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>C2</name>
          <description>CMP Control Register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACOn</name>
              <description>The result of the input comparison for channel n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INITMOD</name>
              <description>Comparator and DAC initialization delay modulus.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INITMOD_0</name>
                  <description>The modulus is set to 64(same with 111111).</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSAM</name>
              <description>Number of sample clocks</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSAM_0</name>
                  <description>The comparison result is sampled as soon as the active channel is scanned in one round-robin clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSAM_1</name>
                  <description>The sampling takes place 1 round-robin clock cycle after the next cycle of the round-robin clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSAM_2</name>
                  <description>The sampling takes place 2 round-robin clock cycles after the next cycle of the round-robin clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSAM_3</name>
                  <description>The sampling takes place 3 round-robin clock cycles after the next cycle of the round-robin clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH0F</name>
              <description>Channel 0 input changed flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH1F</name>
              <description>Channel 1 input changed flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH2F</name>
              <description>Channel 2 input changed flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH3F</name>
              <description>Channel 3 input changed flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH4F</name>
              <description>Channel 4 input changed flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH5F</name>
              <description>Channel 5 input changed flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH6F</name>
              <description>Channel 6 input changed flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH7F</name>
              <description>Channel 7 input changed flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FXMXCH</name>
              <description>Fixed channel selection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FXMXCH_0</name>
                  <description>Channel 0 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_1</name>
                  <description>Channel 1 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_2</name>
                  <description>Channel 2 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_3</name>
                  <description>Channel 3 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_4</name>
                  <description>Channel 4 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_5</name>
                  <description>Channel 5 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_6</name>
                  <description>Channel 6 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_7</name>
                  <description>Channel 7 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FXMP</name>
              <description>Fixed MUX Port</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FXMP_0</name>
                  <description>The Plus port is fixed. Only the inputs to the Minus port are swept in each round.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMP_1</name>
                  <description>The Minus port is fixed. Only the inputs to the Plus port are swept in each round.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRIE</name>
              <description>Round-Robin interrupt enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RRIE_0</name>
                  <description>The round-robin interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RRIE_1</name>
                  <description>The round-robin interrupt is enabled when a comparison result changes from the last sample.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRE</name>
              <description>Round-Robin Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RRE_0</name>
                  <description>Round-robin operation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RRE_1</name>
                  <description>Round-robin operation is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
