zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE14F16/MKE14F16.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>CoreDebug</name>
      <description>Core Debug Registers</description>
      <groupName>COREDEBUG</groupName>
      <baseAddress>0xE000EDF0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DHCSR_Read</name>
          <description>Debug Halting Control and Status Register</description>
          <alternateGroup>DHCSR_Read_DHCSR_Write</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C_DEBUGEN</name>
              <description>Halting debug enable bit. If a debugger writes to DHCSR to change the value of this bit from 0 to 1, it must also write 0 to the C_MASKINTS bit, otherwise behavior is UNPREDICTABLE.This bit can only be set to 1 from the DAP, it cannot be set to 1 under software control.This bit is 0 after a Power-on reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C_DEBUGEN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C_DEBUGEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C_HALT</name>
              <description>Processor halt bit. This bit is UNKNOWN after a Power-on reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C_HALT_0</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C_HALT_1</name>
                  <description>Halt the processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C_STEP</name>
              <description>Processor step bit.This bit is UNKNOWN after a Power-on reset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C_STEP_0</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C_STEP_1</name>
                  <description>Step the processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C_MASKINTS</name>
              <description>C_MASKINTS bit. When debug is enabled, the debugger can write to this bit to mask PendSV, SysTick and external configurable interrupts. The effect of any attempt to change the value of this bit is UNPREDICTABLE unless both:- before the write to DHCSR, the value of the C_HALT bit is 1.- the write to the DHCSR that changes the C_MASKINTS bit also writes 1 to the C_HALT bit.This means that a single write to DHCSR cannot set the C_HALT to 0 and change the value of the C_MASKINTS bit.The bit does not affect NMI. When DHCSR.C_DEBUGEN is set to 0, the value of this bit is UNKNOWN.This bit is UNKNOWN after a Power-on reset.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C_MASKINTS_0</name>
                  <description>Do not mask.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C_MASKINTS_1</name>
                  <description>Mask PenSV, SysTick and external configurable interrupts.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C_SNAPSTALL</name>
              <description>C_SNAPSTALL bit. If the processor is stalled on a load or store operation, a debugger can set this bit to 1 to attempt to break the stall. The effect of setting this bit to 1 is UNPREDICTABLE unless the DHCSR write also sets C_DEBUGEN and C_HALT to 1.This means that if the processor is not already in Debug statea it enters Debug state when the stalled instruction completes.Writing 1 to this bit makes the state of the memory system UNPREDICTABLE. Therefore, if a debugger writes 1 to this bit it must reset the processor before leaving Debug state.A Power-on reset sets this bit to 0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C_SNAPSTALL_0</name>
                  <description>No action.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C_SNAPSTALL_1</name>
                  <description>Attempt to force any stalled load or store instruction to complete.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_REGRDY</name>
              <description>S_REGRDY bit. A handshake flag for transfers through the DCRDR:- Writing to DCRSR clears the bit to 0.- Completion of the DCRDR transfer then sets the bit to 1.This bit is valid only when the processor is in Debug state, otherwise the bit is UNKNOWN.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_REGRDY_0</name>
                  <description>There has been a write to the DCRDR, but the transfer is not complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_REGRDY_1</name>
                  <description>The transfer to or from the DCRDR is complete.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_HALT</name>
              <description>S_HALT bit. Indicates whether the processor is in Debug state.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_HALT_0</name>
                  <description>Not in Debug state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_HALT_1</name>
                  <description>In Debug state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_SLEEP</name>
              <description>S_SLEEP bit. Indicates whether the processor is sleeping.The debugger must set the C_HALT bit to 1 to gain control, or wait for an interrupt or other wakeup event to wakeup the system.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_SLEEP_0</name>
                  <description>Not sleeping.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_SLEEP_1</name>
                  <description>Sleeping.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_LOCKUP</name>
              <description>S_LOCKUP bit. Indicates whether the processor is locked up because of an unrecoverable exception.This bit can only be read as 1 by a remote debugger, using the DAP. The value of 1 indicates that the processor is running but locked up.The bit clears to 0 when the processor enters Debug state.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_LOCKUP_0</name>
                  <description>Not locked up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_LOCKUP_1</name>
                  <description>Locked up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_RETIRE_ST</name>
              <description>S_RETIRE_ST bit. Indicates whether the processor has completed the execution of an instruction since the last read of DHCSR.This is a sticky bit, that clears to 0 on a read of DHCSR.A debugger can check this bit to determine if the processor is stalled on a load, store or fetch access.This bit is UNKNOWN after a Power-on or Local reset, but then is set to 1 as soon as the processor executes and retires an instruction.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_RETIRE_ST_0</name>
                  <description>No instruction retired since last DHCSR read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_RETIRE_ST_1</name>
                  <description>At least one instruction retired since last DHCSR read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_RESET_ST</name>
              <description>S_RESET_ST bit. Indicates whether the processor has been reset since the last read of DHCSR.This is a sticky bit, that clears to 0 on a read of DHCSR.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_RESET_ST_0</name>
                  <description>No reset since last DHCSR read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_RESET_ST_1</name>
                  <description>At least one reset since last DHCSR read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DHCSR_Write</name>
          <description>Debug Halting Control and Status Register</description>
          <alternateGroup>DHCSR_Read_DHCSR_Write</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C_DEBUGEN</name>
              <description>Halting debug enable bit. If a debugger writes to DHCSR to change the value of this bit from 0 to 1, it must also write 0 to the C_MASKINTS bit, otherwise behavior is UNPREDICTABLE.This bit can only be set to 1 from the DAP, it cannot be set to 1 under software control.This bit is 0 after a Power-on reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C_DEBUGEN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C_DEBUGEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C_HALT</name>
              <description>Processor halt bit. This bit is UNKNOWN after a Power-on reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C_HALT_0</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C_HALT_1</name>
                  <description>Halt the processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C_STEP</name>
              <description>Processor step bit.This bit is UNKNOWN after a Power-on reset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C_STEP_0</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C_STEP_1</name>
                  <description>Step the processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C_MASKINTS</name>
              <description>C_MASKINTS bit. When debug is enabled, the debugger can write to this bit to mask PendSV, SysTick and external configurable interrupts. The effect of any attempt to change the value of this bit is UNPREDICTABLE unless both:- before the write to DHCSR, the value of the C_HALT bit is 1.- the write to the DHCSR that changes the C_MASKINTS bit also writes 1 to the C_HALT bit.This means that a single write to DHCSR cannot set the C_HALT to 0 and change the value of the C_MASKINTS bit.The bit does not affect NMI. When DHCSR.C_DEBUGEN is set to 0, the value of this bit is UNKNOWN.This bit is UNKNOWN after a Power-on reset.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C_MASKINTS_0</name>
                  <description>Do not mask.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C_MASKINTS_1</name>
                  <description>Mask PenSV, SysTick and external configurable interrupts.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C_SNAPSTALL</name>
              <description>C_SNAPSTALL bit. If the processor is stalled on a load or store operation, a debugger can set this bit to 1 to attempt to break the stall. The effect of setting this bit to 1 is UNPREDICTABLE unless the DHCSR write also sets C_DEBUGEN and C_HALT to 1.This means that if the processor is not already in Debug statea it enters Debug state when the stalled instruction completes.Writing 1 to this bit makes the state of the memory system UNPREDICTABLE. Therefore, if a debugger writes 1 to this bit it must reset the processor before leaving Debug state.A Power-on reset sets this bit to 0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C_SNAPSTALL_0</name>
                  <description>No action.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C_SNAPSTALL_1</name>
                  <description>Attempt to force any stalled load or store instruction to complete.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGKEY</name>
              <description>Debug key:Software must write 0xA05F to this field to enable write accesses to bits [15:0], otherwise the processor ignores the write access.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRSR</name>
          <description>Debug Core Register Selector Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>REGSEL</name>
              <description>REGSEL bits. Specifies the ARM core register, special-purpose register, or Floating-point extension register, to transfer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REGWnR</name>
              <description>REGWnR bit. Specifies the access type for the transfer.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGWnR_0</name>
                  <description>Read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REGWnR_1</name>
                  <description>Write</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRDR</name>
          <description>Debug Core Register Data Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DBGTMP</name>
              <description>DBGTMP bits. Data temporary cache, for reading and writing the ARM core registers, special-purpose registers, and Floating-point extension registers.The value of this register is UNKNOWN:- on reset- if the processor is in Debug state, the debugger has written to DCRSR since entering Debug state and DHCSR.S_REGRDY is set to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
